Revit 2026 API

# FamilyIsUserCreated Property

---

Determine whether the family has been defined by the user.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsUserCreated { get; }
```
```vb
Public ReadOnly Property IsUserCreated As Boolean
	Get
```
```cpp
public:
property bool IsUserCreated {
	bool get ();
}
```
```fsharp
member IsUserCreated : bool with get
```

#### Property Value

Boolean

Some families are created internally and cannot be saved or reloaded. This function will return False for such internal families.

#### Reference

Family Class

Autodesk.Revit.DB Namespace